/* 07 반복문과 조건문 활용(2)
    아래 scores는 광주 소프트웨어마이스터고등학교 학생들의 과제 평가 점수를 배열에 담아 놓은 것이다. 이때 90점 이상의 점수를 맞은 학생들의
    평균과 학생 수, 60점 미만의 점수를 맞은 학생들의 평균과 학생 수를 구하는 코드를 작성한 후 출력 결과와 동일한 출력을 해주세요.
*/

//주어진 변수(scores) 직접 수정 불가
//출력 결과 :
// 90점 이상 학생들의 평균 점수 : 97.2, 90점 이상 학생 수 : 5명
// 60점 미만 학생들의 평균 점수 : 44.0, 60점 미만 학생 수 : 3명
package control;

public class NestingLoopsAndConditionalsEx2 {
    public static void main(String[] args) {
        int[] scores = {66,54,89,92,98,100,33,45,97,99,67,87};
        // 다음 라인에 코드를 작성 해 주세요.
    }
}
