/* 07 반복문과 조건문 활용(1)
    광주 소프트웨어마이스터고등학교에 합격하기 위해선 시험 점수가 70점 이상이 되어야 한다. 시험 점수가 70점 이상일 경우
    '@번 학생 축하합니다!! 광주 소프트웨어마이스터고등학교에 최종 합격하셨습니다'를 출력하고, 70점 미만일 경우
    '@번 학생 아쉽지만 다음 기회에 다시 지원해 주시길 바랍니다.'를 출력하는 코드를 작성해 주시고, 출력 결과와 동일한 출력을 해주세요.
*/

// 주어진 변수(scores, student_index) 변경 불가
// 출력결과 :
// 1번 학생 축하합니다!! 광주 소프트웨어마이스터고등학교에 최종 합격하셨습니다.
// 2번 학생 아쉽지만 다음 기수에 다시 지원해 주시길 바랍니다.
// 3번 학생 아쉽지만 다음 기수에 다시 지원해 주시길 바랍니다.
// 4번 학생 축하합니다!! 광주 소프트웨어마이스터고등학교에 최종 합격하셨습니다.
// 5번 학생 축하합니다!! 광주 소프트웨어마이스터고등학교에 최종 합격하셨습니다.
// 6번 학생 축하합니다!! 광주 소프트웨어마이스터고등학교에 최종 합격하셨습니다.
// 7번 학생 아쉽지만 다음 기회에 다시 지원해 주시길 바랍니다.
// 8번 학생 아쉽지만 다음 기회에 다시 지원해 주시길 바랍니다.
// 9번 학생 축하합니다!! 광주 소프트웨어마이스터고등학교에 최종 합격하셨습니다.
package control;

public class NestingLoopsAndConditionalsEx1 {
    public static void main(String[] args) {
        int[] scores = {80, 65, 43, 78, 88, 100, 44, 55, 75};
        int student_index = 0;
        // 다음 라인에 코드를 작성 해 주세요.
    }
}
