/* 04 중첩 조건문
중첩 조건문(nested conditionals)을 사용하여 시간과 날씨(비 오는 여부)에 따라 식사 장소를 결정하는 프로그램입니다.
아침 식사 (7시 ~ 11시): "아침을 먹으러 "를 출력합니다.
시간이 아침 시간대인지 확인하고 비가 오면 "주방으로 가자."를 출력 하지만 비가 오지 않으면 "뒷마당으로 가자."를 출력합니다.
점심 식사 (11시 ~ 15시): "점심을 먹으러 "를 출력합니다.
시간이 점심 시간대인지 확인하고 비가 오면 "식당에 가자."를 출력 하지만 비가 오지 않으면 "레스토랑에 가자."를 출력합니다.
저녁 식사 (15시 ~ 21시): "저녁을 먹으러 "를 출력합니다.
시간이 저녁 시간대인지 확인하고 비가 오면 "식당에 가자."를 출력 하지만 비가 오지 않으면 "쇼핑몰에 가자."를 출력합니다.
나머지 시간대:
"생각해보니... 지금은 먹을 시간이 아니다."를 출력합니다.
*/
// 출력결과
// 배고프다, 뭐 먹으러 갈래?
// 점심을 먹으러 레스토랑에 가자.
package control;

public class NestingConditionals {
    public static void main(String[] args) {
        int hour24Format = 13; //13 hours is equivalent to 1 P.M.
        boolean isItRaining = false;
        System.out.println("배고프다. 뭐 먹으러 갈래?");
        // 다음 라인에 코드를 작성 해 주세요.
    }
}
