/* 05 반복문(1)
    아래의 1), 2), 3) 상황을 읽고, pass를 지운 후 코드를 작성해 주시고, 출력 결과와 동일한 출력을 해주세요.
    1) 변사또는 춘향이 집에 찾아가 하루에 한 번씩 '춘향아 주말에 스마트폰이 우리의 삶에 미치는 영향에 대한 토론하는 건 어떠니?'라고 물어본다.
    2) 춘향이는 매일 같이 질문하는 변사또를 '싫어요!!'라고 5번 거절을 한 뒤, 몽룡이와 광주 소프트웨어마이스터고등학교에 입학하러 떠나버린다.
    3) 변사또는 춘향이가 광주로 떠난 줄 모르고 춘향이 집에 갔더니 춘향의 어머니인 월매가 '춘향이 광주 소프트웨어마이스터고등학교에 입학했네!!'
    라고 야단을 치며 돌려보냈다.
*/

// 주어진 변수(byun_question_count) 및 while 변경 불가능
// 출력 결과 :
// 변사또 : 춘향아 주말에 스마트폰이 우리의 삶에 미치는 영향에 대한 토론하는 건 어떠니?
// 춘향이 : 싫어요!!
// 변사또 : 춘향아 주말에 스마트폰이 우리의 삶에 미치는 영향에 대한 토론하는 건 어떠니?
// 춘향이 : 싫어요!!
// 변사또 : 춘향아 주말에 스마트폰이 우리의 삶에 미치는 영향에 대한 토론하는 건 어떠니?
// 춘향이 : 싫어요!!
// 변사또 : 춘향아 주말에 스마트폰이 우리의 삶에 미치는 영향에 대한 토론하는 건 어떠니?
// 춘향이 : 싫어요!!
// 변사또 : 춘향아 주말에 스마트폰이 우리의 삶에 미치는 영향에 대한 토론하는 건 어떠니?
// 춘향이 : 싫어요!!
// 월매 : 춘향이 광주 소프트웨어마이스터고등학교에 입학했네!!
package control;

public class WhileLoop {
    public static void main(String[] args) {
        var byun_question_count = 0;

        while (true) {
            // 다음 라인에 코드를 작성 해 주세요.
        }
    }
}
